WELCOME = """Вітаємо! 

Дякуємо, що ти хочеш стати важливою ланкою механізму <a href='https://www.instagram.com/nova.ab3?igsh=YnVkdDBmbWZvZHN5&utm_source=qr'>@nova.ab3</a> Третьої штурмової

Збір 5 000 000 грн  покриє потреби у ремонті і модернізації наземних дронів.  

Кожен боєздатний дрон - це довезений вантаж на передову і збережене життя наших побратимів. 

"""
SHARE_PHONE = """Для того, щоб продовжити, надай свій номер телефону (тицяй кнопку "Поділитися номером телефону") ⬇️"""
SELECT_ROLE = """Варіанти, як ти можеш включитися💡

1️⃣Амбасадор збору  
Твоя ціль - запустити механізм збору NOVA KUZNIA. Обираєш свою ціль на 50К+ грн.  Збираєш свою команду і запускаєш свою двіжуху. 
І звісно, ж ти не сам. Ми будемо у супроводі і на зв`язку.
⚡️Бути амбасадором - це відповідально і хвилююче, але потужне підсилення!  Ну і, звісно, від нас тобі буде особлива 🏅. 

2️⃣Учасник збору -  це важлива ланка збору.  Без твоєї дружньої банки годі справитися. Минула NOVA KUZNIA 1.0 без цієї ланки не справилася б так точно. 
Все працює по налагодженому механізму.  Обираєш амбасадора збору, до команди якого ти хочеш долучитися. Обираєш суму (від 1К👀 до 50К💪 грн). Від нас все під 🔧  - дизайн, текст, ну і спільнота. А ще згодом ми презентуємо пам`ятний 🎁 про цей збір.
"""
UNKNOWN_ROLE = """Невідома роль. Будь ласка, спробуйте ще раз."""
PARTICIPANT_NAME_PROMPT = """Крок 2/6: Як до тебе звертатися? (напиши своє ім'я)"""
MENTOR_NAME_PROMPT = """Крок 1/6: Як до тебе звертатися? (напиши своє ім'я)"""
MENTOR_INSTAGRAM_PROMPT = """Крок 2/6: Будь ласка, поділись своїм ніком у Instagram."""
PARTICIPANT_SELECT_MENTOR_PROMPT = """Крок 1/6: Обери свого амбасадора"""
PARTICIPANT_INSTAGRAM_PROMPT = """Крок 3/6: Будь ласка, поділись своїм ніком у Instagram.  """
MENTOR_GOAL_PROMPT = """Крок 3/6: Напиши бажану суму, якою б хотів підсилити NOVA KUZNIA. 
"Не піднявшись на високу гору, не пізнаєш висоти неба" @Сунь Цзи"""
PARTICIPANT_GOAL_PROMPT = """Крок 4/6: Введи бажану суму збору, наприклад, 10000 грн"""
SELECTED_MENTOR = """🎉 Ти обрав амбасадора """
MENTOR_JAR_PROMPT = """Крок 4/6 Поділись посиланням на банку для збору. 
Створи окреме посилання на банку, щоб твої друзі змогли відкрити банку від твоєї.


Приклад: 

Назва банки: NOVA KUZNIA 2.0
Опис банки:  Збираємо разом з командою ukr.zbyrachi на ремонт і модернізацію наземних дронів підрозділу NOVA 3 ОШБр 
Картинка банки: обери свою або викачай заставку боту NOVA KUZNIA."""
PARTICIPANT_JAR_PROMPT = """Крок 5/6 Поділися посиланням на банку для збору"""

MENTOR_PHOTO_PROMPT = """Крок 6/6: Надішли файлом фото для свого профілю і для дизайну у соцмережах."""
PARTICIPANT_PHOTO_PROMPT = """Крок 6/6: Надішли файлом фото для свого профілю і для дизайну у соцмережах."""
MENTOR_DESCRIPTION_PROMPT = """Крок 5/6: Напиши опис свого профілю, який будуть бачити всі учасники при виборі амбасадора.

Приклад: 

Микола. Можу навчатися, працювати завдяки тому, що хлопці та дівчата боронять країну. Зібрати команду на збір - це найменше, що можу зробити, але важливе, що може зберегти життя нашим героям.  Долучайся до команди.
"""
SEND_AS_FILE_WARNING = """⚠️ Будь ласка, надішли фото як файл (не стисле)"""
NOT_IMAGE_FILE = """❌ Будь ласка, надішли фото як файл."""

INVALID_INSTAGRAM = """❌ Невірний Instagram. Введіть правильне ім’я користувача."""
INVALID_JAR_URL = """❌ Неправильне посилання на банку. Введіть коректне посилання."""

CONFIRM_PROFILE = """Підтвердити профіль?"""
PROFILE_SAVED_MENTOR = """✅Профіль амбасадора збережено.
Очікуй затвердження своєї участі. Наш координатор зв'яжеться з тобою.  
Також згодом бот надішле тобі готовий дизайн для збору і шаблон тексту."""
PROFILE_CONFIRMED = """✅ Підтверджено"""
CONFIRM_PROFILE_VIEW = """Ось, як бачитимуть твій профіль учасники збору. Ми ще додамо дизайн і буде🍬
Якщо все вірно і тобі все підходить, то тисни '✅ Підтвердити'!"""
PROFILE_SAVED_PARTICIPANT = """✅ Профіль учасника збережено. Щоб переглянути, пиши /profile"""
PROFILE_CANCELLED = """Профіль не підтверджено. Можете почати спочатку з команди /start."""

ALREADY_REGISTERED_PARTICIPANT = """❌ Ви вже зареєстровані як учасник"""
ALREADY_REGISTERED_MENTOR = """❌ Ви вже зареєстровані як амбасадор"""
USER_NOT_REGISTERED = """❌ Ви ще не зареєстровані. Почніть з команди /start"""
NOT_ALLOWED = """🚫 Дія заборонена"""
NOT_ADMIN = """⛔ Ви не маєте права використовувати цю команду."""
INVALID_NUMBER = """Будь ласка, введіть коректне число для вашої цілі."""
MENTOR_NOT_FOUND = """Амбасадор не знайдений"""

NEW_MENTOR_PENDING = """Новий амбасадор зареєструвався і очікує вашого підтвердження:"""
MANAGE_PENDING_MENTORS = """Амбасадорів можна затверджувати командою /pending_mentors"""
NEW_PARTICIPANT_JOINED = """Новий учасник приєднався до вашої групи!"""
MANAGE_YOUR_GROUP = """Ви можете переглянути учасників своєї групи за допомогою команди /team"""
CONFIRM_PROFILE = """Підтвердити профіль?"""
APPROVE = """✅ Підтвердити"""
REJECT = """❌ Скасувати"""

NO_PARTICIPANTS = """У вас поки немає учасників."""
REGISTERED_USERS_HEADER = """👥 *Зареєстровані користувачі:*"""
REGISTERED_MENTORS_HEADER = """👥 *Зареєстровані амбасадори:*"""
MY_PARTICIPANTS_HEADER = """👥 Ваші учасники:\n\n"""
NO_USERS_FOUND = """📂 У базі даних не знайдено користувачів."""
NO_MENTORS_FOUND = """📂 У базі даних не знайдено амбасадорів."""
NO_MENTORS_AVAILABLE = """Амбасадори поки що не доступні. Спробуйте пізніше."""
NO_PENDING_MENTORS = """📭 Зараз немає амбасадорів, що очікують підтвердження."""

MENTOR_APPROVED = """✅ Амбасадора затверджено."""
MENTOR_REJECTED = """❌ Амбасадора відхилено та вилучено з бази."""

REMOVE_USER_USAGE = """⚠️ Використання: /remove_user <user_id>"""
USER_PROFILE_USAGE = """⚠️ Використання: /user_profile <user_id>"""
USER_REMOVED = """✅ Користувача видалено з бази даних."""
MENTOR_HAS_TEAM_EXCEPTION = """❌ Не можна видалити амбасадора, який має команду"""
REMOVE_USER_EXCEPTION = """❌ Не вдалося видалити користувача"""

USER_NOT_FOUND = """❌ Користувача не знайдено."""
MENTOR_NOT_FOUND = """❌ Амбасадор не знайдений."""

SEPARATOR = f"""{'═'*16}\n"""
PARTICIPANT_PROFILE_HEADER = """    Учасник збору"""
MENTOR_PROFILE_HEADER = """  Амбасадор збору"""
PROFILE_NAME = """👤 Ім’я (в телеграм): """
DEFAULT_PROFILE_NAME = """👤 Ім’я: """
PROFILE_PHONE = """📱 Телефон: """
PROFILE_INSTAGRAM = """📸 Інстаграм: """
PROFILE_GOAL = """🎯 Ціль: """
PROFILE_DESCRIPTION = """📝 Опис: """
PROFILE_STATUS = """📌 Статус: """
PROFILE_MENTOR = """👨‍🏫 Амбасадор: """
PROFILE_JAR = """🫙 Банка: """

PHONE_SHARE_BUTTON = """📱 Поділитися номером телефону"""

ROLE_MENTOR_BUTTON = """Амбасадор⚙️"""
ROLE_PARTICIPANT_BUTTON = """Дружній збір - ланка🔗"""

CONFIRM_YES = """Так ✅"""
CONFIRM_NO = """Ні ❌"""

CAROUSEL_LEFT = """⬅️"""
CAROUSEL_RIGHT = """➡️"""
CAROUSEL_SELECT = """✅ Обрати"""

MENU_PROMPT = """Ви в головному меню. Використовуйте команди нижче для навігації:
"""
RESTART_PROMPT = """Почнімо реєєстрацію заново"""
MENTOR_COMMANDS = """/team - Переглянути учасників вашої групи
/profile_view - Переглянути представлення вашого профілю
"""
PARTICIPANT_COMMANDS = """/mentor - Переглянути інформацію про вашого амбасадора
"""
ADMIN_COMMANDS = """/list_users - Переглянути всіх користувачів
/pending_mentors - Переглянути амбасадорів, що очікують підтвердження
/remove_user <user_id> - Видалити користувача за ID
/user_profile <user_id> - Переглянути профіль користувача за ID
"""
TECH_SUPPORT_COMMANDS = """/list_questions - переглянути всі запитання
/answer - відповісти на запитання
"""

START_BUTTON = """Поїхали 🚗"""
CONFIRM_DATA_PROCESSING = """Чи даєш згоду на обробку своїх персональних даних? """
PARTICIPANT_REGISTRATION_END = """Реєстрація завершена, тепер чекай від нас дизайн. Ми як найшвидше тобі дамо відповідь (спробуємо до 22:00 сьогодні). 

Якщо маєш будь-які питання - пиши нам: /help"""

HELP_PROMPT = """Надішли своє запитання мені в наступному повідомленні, а я передам у тех підтримку"""
HELP_REQUESTED_PROMPT = """Передав твоє запитання, очікуй на відповідь"""

QUESTION_LIST_HEADER = """Список запитань: """
SUGGEST_ANSWER_COMMAND = """Щоб відповісти - пиши /answer"""
SELECT_QUESTION = """Обери запитання, на яке хочеш відповісти"""
QUESTIONS_NOT_FOUND = """📭 Запитань поки немає."""
CANCELED = """Скасовано"""
SELECT_USER = """Оберіть користувача:"""
DESIGN_MSG = """Ось твій дизайн"""

FUNDRAISING_DESIGN_2000_10000 = """
    
    Деталі важливі. І кожна деталь може врятувати життя на передовій.
    
    Я долучаюсь до команди @{instagram} і відкриваю збір, щоб працював механізм NOVA KUZNIA. Це майстерні наземних дронів підрозділу @nova.ab3 Третьої штурмової.
    
    Загальна ціль: 5 000 000 грн на ремонт і модернізацію НРК, що доставляють важливі вантажі на передову та евакуюють поранених.
    
    Я плюсую швидкість для дрона, тому спробуємо швидко зібрати.
    
    Моя ціль - {amount} грн.
    
    Посилання на донати у шапці профілю.
    
    Пиши мені або став +, якщо хочеш стати важливою ланкою збору та бути у команді."""

FUNDRAISING_DESIGN_10000_150000 = """
    
    Деталі важливі. І кожна деталь може врятувати життя на передовій.
    
    Я долучаюсь до команди @{instagram} і відкриваю збір, щоб працював механізм NOVA KUZNIA. Це майстерні наземних дронів підрозділу @nova.ab3 Третьої штурмової.
    
    Загальна ціль: 5 000 000 грн на ремонт і модернізацію НРК, що доставляють важливі вантажі на передову та евакуюють поранених.
    
    Я плюсую зір для дрона, тому дивлюся з оптимізмом закрити мою банку.
    
    Моя ціль - {amount} грн.
    
    Посилання на донати у шапці профілю.
    
    Пиши мені або став +, якщо хочеш стати важливою ланкою збору та бути у команді."""

FUNDRAISING_DESIGN_150000_20000 = """
    
    Деталі важливі. І кожна деталь може врятувати життя на передовій.
    
    Я долучаюсь до команди @{instagram} і відкриваю збір, щоб працював механізм NOVA KUZNIA. Це майстерні наземних дронів підрозділу @nova.ab3 Третьої штурмової.
    
    Загальна ціль: 5 000 000 грн на ремонт і модернізацію НРК, що доставляють важливі вантажі на передову та евакуюють поранених.
    
    Я плюсую зв’язок для дрона, тому підключаю свої звʼязки для збору.
    
    Моя ціль - {amount} грн.
    
    Посилання на донати у шапці профілю.
    
    Пиши мені або став +, якщо хочеш стати важливою ланкою збору та бути у команді."""

FUNDRAISING_DESIGN_20000_25000 = """
    
    Деталі важливі. І кожна деталь може врятувати життя на передовій.
    
    Я долучаюсь до команди @{instagram} і відкриваю збір, щоб працював механізм NOVA KUZNIA. Це майстерні наземних дронів підрозділу @nova.ab3 Третьої штурмової.
    
    Загальна ціль: 5 000 000 грн на ремонт і модернізацію НРК, що доставляють важливі вантажі на передову та евакуюють поранених.
    
    Я плюсую зв’язок для дрона, тому підключаю свої звʼязки для збору.
    
    Моя ціль - {amount} грн.
    
    Посилання на донати у шапці профілю.
    
    Пиши мені або став +, якщо хочеш стати важливою ланкою збору та бути у команді."""

FUNDRAISING_DESIGN_25000_50000 = """
    
    Деталі важливі. І кожна деталь може врятувати життя на передовій.
    
    Я долучаюсь до команди @{instagram} і відкриваю збір, щоб працював механізм NOVA KUZNIA. Це майстерні наземних дронів підрозділу @nova.ab3 Третьої штурмової.
    
    Загальна ціль: 5 000 000 грн на ремонт і модернізацію НРК, що доставляють важливі вантажі на передову та евакуюють поранених.
    
    Я плюсую рішучість контролера дрона, тому рішуче вриваюсь у збір.
    
    Моя ціль - {amount} грн.
    
    Посилання на донати у шапці профілю.
    
    Пиши мені або став +, якщо хочеш стати важливою ланкою збору та бути у команді."""

FUNDRAISING_DESIGN_MENTOR = """
    
    Деталі важливі. І кожна деталь може врятувати життя на передовій.
    Особливо, якщо це деталі для наземних дронів підрозділу @nova.ab3 Третьої штурмової.
    Долучаюсь як амбасадор до збору NOVA KUZNIA. NOVA KUZNIA - це частина механізму підрозділу, що впливає на успіш
    
    Моя ціль:  {amount}
    Загальна сума збору: 5 000 000 грн.
    
    «Плюсуй» швидкість, звʼязок, силу, очі, рішучість. Збирай на колеса, звʼязок, двигуни, камери та контролери. Щоб механізм ремонту та модернізації НРК для підрозділу Всі ми різні, але кожен з нас — важлива деталь у щоденній боротьбі!
    
    Відкривай банку на свою деталь. Або донать за посиланням у шапці профілю."""

DESIGN_SENT = """Лови свій дизайн з текстом до поста:"""
DESIGN_INSTRUCTIONS = """Ти можеш редагувати текст, але сенс і структуру тексту не змінювати.
Всі питання по збору можеш уточнити у свого амбасадора або в мене (обери пункт меню 'маю питання'). Дякуємо!"""

PROFILE_BUTTON = """Переглянути свій профіль 👤"""
PROFILE_VIEW_BUTTON = """Як учасники збору бачать мій профіль 👀"""
TEAM_BUTTON = """Переглянути учасників моєї команди 👥"""
CHANGE_GOAL_BUTTON = """Змінити ціль збору 🎯"""
CHANGE_DESCRIPTION_BUTTON = """Змінити опис профілю 📝"""
CHANGE_MONOBANK_BUTTON = """Змінити посилання на банку 🏦"""
CHANGE_INSTAGRAM_BUTTON = """Змінити нікнейм в інстаграм 📸"""
MENTOR_BUTTON = """Переглянути профіль мого амбасадора 🧑‍🏫"""
LIST_USERS_BUTTON = """Переглянути список користувачів 📋"""
PENDING_MENTORS_BUTTON = """Затвердити амбасадорів ✅"""
LIST_MENTORS_BUTTON = """Переглянути список амбасадорів 🧑‍🏫"""
REMOVE_USER_BUTTON = """Видалити користувача ❌"""
USER_PROFILE_BUTTON = """Переглянути профіль користувача 👤"""
SEND_DESIGN_BUTTON = """Надіслати дизайн поста 🎨"""
LIST_QUESTIONS_BUTTON = """Переглянути список запитань ❓"""
ANSWER_BUTTON = """Відповісти на запитання 💬"""
RESTART_BUTTON = """Зареєструватися заново 🔄"""
HELP_BUTTON = """Є питання ❓"""
YOU_HAVE_BEEN_APPROVED = """Вітаю, тебе затверджено як амбасадора збору 🎊"""
CHANGE_DESCRIPTION_MSG = """Напиши новий опис профілю. 
Зараз твій опис виглядає так: 
'{current_description}'
"""
NEW_DESCRIPTION_SET = """✅ Опис профілю оновлено"""
CHANGE_GOAL_MSG = """Напиши нову ціль для збору 
Твоя теперішня ціль: {current_goal}грн
"""
NEW_GOAL_SET = """✅ Ціль збору оновлено"""
CHANGE_MONOBANK_MSG = """Надішли новий лінк на банку. 
Зараз посилання на банку так: {current_monobank}
"""
NEW_MONOBANK_SET = """✅ Лінк на банку оновлено"""
CHANGE_INSTAGRAM_MSG = """Напиши новий нік в інстаграм. 
Ось, який нік в тебе зараз: {current_instagram} 
"""
NEW_INSTAGRAM_SET = """✅ Нік в інстаграм оновлено"""