WELCOME = """Вітаємо! 

Дякуємо, що ти хочеш стати важливою ланкою механізму <a href='https://www.instagram.com/nova.ab3?igsh=YnVkdDBmbWZvZHN5&utm_source=qr'>@nova.ab3</a> Третьої штурмової

Збір 5 000 000 грн  покриє потреби у ремонті і модернізації наземних дронів.  

Кожен боєздатний дрон - це довезений вантаж на передову і збережене життя наших побратимів. 

"""
SHARE_PHONE = """Для того, щоб продовжити, надай свій номер телефону (тицяй кнопку "Поділитися номером телефону") ⬇️"""
SELECT_ROLE = """
Варіанти, як ти можеш включитися💡

1️⃣Амбасадор(ка) збору  
Твоя ціль - запустити механізм збору NOVA KUZNIA. Обираєш свою ціль на 50К+ грн.  Збираєш свою команду і запускаєш свою двіжуху. 
І звісно, ж ти не сам(а). Ми будемо у супроводі і на зв`язку.
⚡️Бути амбасадором - це відповідально і хвилююче, але потужне підсилення!  Ну і, звісно, від нас тобі буде особлива нагорода. 



2️⃣  Важлива ланка збору. Це дружня банка!  Без тебе годі справитися. Минула NOVA KUZNIA 1.0 без цієї ланки не справилася. 
Все працює по налагодженому механізму.  Обираєш амбасадора(ку) збору, до команди якого(ї) ти хочеш долучитися. Обираєш суму (від 1К👀 до 50К💪 грн). Від нас все під 🔧  - дизайн, текст, ну і спільнота. А ще згодом ми презентуємо пам`ятний 🎁 про цей збір.
"""
UNKNOWN_ROLE = """Невідома роль. Будь ласка, спробуйте ще раз."""
MENTOR_INSTAGRAM_PROMPT = """Крок 1/5: Будь ласка, поділись своїм Instagram для профілю амбасадора(ки)"""
PARTICIPANT_SELECT_MENTOR_PROMPT = """Крок 1/5: Обери свого амбасадора(ку)"""
PARTICIPANT_INSTAGRAM_PROMPT = """Крок 2/5: Будь ласка, поділись своїм Instagram"""
MENTOR_GOAL_PROMPT = """Крок 2/5: Введи бажану суму збору (від 50000 грн)"""
PARTICIPANT_GOAL_PROMPT = """Крок 3/5: Введи бажану суму збору (від 1000 грн)"""
SELECTED_MENTOR = """🎉 Ти обрав(ла) амбасадора """
MENTOR_JAR_PROMPT = """Крок 3/5 Поділись посиланням на банку для збору. 
Створи окреме посилання на банку, щоб твої друзі змогли відкрити банку від твоєї.


Приклад: 

Назва банки: NOVA KUZNIA 2.0
Опис банки:  Збираємо разом з командою ukr.zbyrachi на ремонт і модернізацію наземних дронів підрозділу NOVA 3 ОШБр 
Картинка банки: обери свою або викачай заставку боту NOVA KUZNIA."""
PARTICIPANT_JAR_PROMPT = """Крок 4/5 Поділися посиланням на банку для збору"""

MENTOR_PHOTO_PROMPT = """Крок 5/5: Надішли фото для свого профілю у форматі файлу."""
PARTICIPANT_PHOTO_PROMPT = """Крок 5/5: Надішли фото для свого профілю у форматі файлу."""
MENTOR_DESCRIPTION_PROMPT = """Крок 4/5: Напиши опис свого профілю, який будуть бачити всі учасники при виборі амбасадора(ки).

Приклад: 

Микола. Можу навчатися, працювати завдяки тому, що хлопці та дівчата боронять країну. Зібрати команду на збір - це найменше, що можу зробити, але важливе, що може зберегти життя нашим героям.  Долучайся до команди Garda Team. """
SEND_AS_FILE_WARNING = """⚠️ Будь ласка, надішли фото як файл (не стисле)"""
NOT_IMAGE_FILE = """❌ Будь ласка, надішли фото як файл."""

INVALID_INSTAGRAM = """❌ Невірний Instagram. Введіть правильне ім’я користувача."""
INVALID_JAR_URL = """❌ Неправильне посилання на банку. Введіть коректне посилання."""

CONFIRM_PROFILE = """Підтвердити профіль?"""
PROFILE_SAVED_MENTOR = """✅ Профіль амбасадора(ки) збережено. Очікується затвердження адміністратором."""
PROFILE_CONFIRMED = """✅ Підтверджено"""
CONFIRM_PROFILE_VIEW = """Ось, як бачитимуть твій профіль амбасадора(ки) учасники збору. Якщо все вірно і тобі все подобається то клацай '✅ Підтвердити'!"""
PROFILE_SAVED_PARTICIPANT = """✅ Профіль учасника збережено. Щоб переглянути, пиши /profile"""
PROFILE_CANCELLED = """Профіль не підтверджено. Можете почати спочатку з команди /start."""

ALREADY_REGISTERED_PARTICIPANT = """❌ Ви вже зареєстровані як учасник"""
ALREADY_REGISTERED_MENTOR = """❌ Ви вже зареєстровані як амбасадор(ка)"""
USER_NOT_REGISTERED = """❌ Ви ще не зареєстровані. Почніть з команди /start"""
NOT_ALLOWED = """🚫 Дія заборонена"""
NOT_ADMIN = """⛔ Ви не маєте права використовувати цю команду."""
INVALID_NUMBER = """Будь ласка, введіть коректне число для вашої цілі."""
MENTOR_NOT_FOUND = """Амбасадор не знайдений"""

NEW_MENTOR_PENDING = """Новий амбасадор(ка) зареєструвався і очікує вашого підтвердження:"""
MANAGE_PENDING_MENTORS = """Амбасадорів можна затверджувати командою /pending_mentors"""
NEW_PARTICIPANT_JOINED = """Новий учасник приєднався до вашої групи!"""
MANAGE_YOUR_GROUP = """Ви можете переглянути учасників своєї групи за допомогою команди /team"""
CONFIRM_PROFILE = """Підтвердити профіль?"""
APPROVE = """✅ Підтвердити"""
REJECT = """❌ Скасувати"""

NO_PARTICIPANTS = """У вас поки немає учасників."""
REGISTERED_USERS_HEADER = """👥 *Зареєстровані користувачі:*"""
REGISTERED_MENTORS_HEADER = """👥 *Зареєстровані амбасадори:*"""
MY_PARTICIPANTS_HEADER = """👥 Ваші учасники:\n\n"""
NO_USERS_FOUND = """📂 У базі даних не знайдено користувачів."""
NO_MENTORS_FOUND = """📂 У базі даних не знайдено амбасадорів."""
NO_MENTORS_AVAILABLE = """Амбасадори поки що не доступні. Спробуйте пізніше."""
NO_PENDING_MENTORS = """📭 Зараз немає амбасадорів, що очікують підтвердження."""

MENTOR_APPROVED = """✅ Амбасадора затверджено."""
MENTOR_REJECTED = """❌ Амбасадора відхилено та вилучено з бази."""

REMOVE_USER_USAGE = """⚠️ Використання: /remove_user <user_id>"""
USER_PROFILE_USAGE = """⚠️ Використання: /user_profile <user_id>"""
USER_REMOVED = """✅ Користувача видалено з бази даних."""
MENTOR_HAS_TEAM_EXCEPTION = """❌ Не можна видалити амбасадора(ку), який має команду"""
REMOVE_USER_EXCEPTION = """❌ Не вдалося видалити користувача"""

USER_NOT_FOUND = """❌ Користувача не знайдено."""
MENTOR_NOT_FOUND = """❌ Амбасадор не знайдений."""

SEPARATOR = f"""{'═'*20}\n"""
PARTICIPANT_PROFILE_HEADER = """      Учасник збору"""
MENTOR_PROFILE_HEADER = """      Амбасадор збору"""
PROFILE_NAME = """👤 Ім’я: """
PROFILE_PHONE = """📱 Телефон: """
PROFILE_INSTAGRAM = """📸 Інстаграм: """
PROFILE_GOAL = """🎯 Ціль: """
PROFILE_DESCRIPTION = """📝 Опис: """
PROFILE_STATUS = """📌 Статус: """
PROFILE_MENTOR = """👨‍🏫 Амбасадор: """
PROFILE_JAR = """🫙 Банка: """

PHONE_SHARE_BUTTON = """📱 Поділитися номером телефону"""

ROLE_MENTOR_BUTTON = """Амбасадор(ка)⚙️"""
ROLE_PARTICIPANT_BUTTON = """Ланка збору🔗"""

CONFIRM_YES = """Так ✅"""
CONFIRM_NO = """Ні ❌"""

CAROUSEL_LEFT = """⬅️"""
CAROUSEL_RIGHT = """➡️"""
CAROUSEL_SELECT = """✅ Обрати"""

MENU_PROMPT = """Ви в головному меню. Використовуйте команди нижче для навігації:
/restart - Оновити профіль
/profile - Переглянути ваш профіль
/help - задати своє запитання у тех підтримку
"""
RESTART_PROMPT = """Почнімо реєєстрацію заново"""
MENTOR_COMMANDS = """/team - Переглянути учасників вашої групи
/profile_view - Переглянути представлення вашого профілю
"""
PARTICIPANT_COMMANDS = """/mentor - Переглянути інформацію про вашого амбасадора(ку)
"""
ADMIN_COMMANDS = """/list_users - Переглянути всіх користувачів
/pending_mentors - Переглянути амбасадорів, що очікують підтвердження
/remove_user <user_id> - Видалити користувача за ID
/user_profile <user_id> - Переглянути профіль користувача за ID
"""

START_BUTTON = """Поїхали 🚗"""
CONFIRM_DATA_PROCESSING = """Чи даєш згоду на обробку своїх персональних даних? """
PARTICIPANT_REGISTRATION_END = """Реєстрація завершена, тепер чекай від нас дизайн. Ми як найшвидше тобі дамо відповідь (спробуємо до 22:00 сьогодні). 

Якщо маєш будь-які питання - пиши нам: /help"""

HELP_PROMPT = """Надішли своє запитання мені в наступному повідомленні, а я передам у тех підтримку"""
HELP_REQUESTED_PROMPT = """Передав твоє запитання, очікуй на відповідь"""
